<?php

/**
 * 订单扩展表字段标识
 * @access public
 * @author wuhaiyan
 * @copyright (c) 2017, Huishoubao
 *
 */

namespace App\Order\Modules\Inc;

class OrderExtendFieldName {

    //--------------------------------------------------------------------------------------------
    //--+ 字段名字标识 --------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------------------
    /**
     * @var int 回访标识
     */
    const FieldVisit = "visit";

}
